app/Controllers/Buku.php

  public function simpan()
  {
    if (!$this->validate([
      'judul' => [
        'rules' => 'required',
        'errors' => [
          'required' => '{field} harus diisi.'
        ]
      ],
      'sampul' => [
        'rules' => 'uploaded[sampul]|max_size[sampul,10000]|is_image[sampul]|mime_in[sampul,image/jpg,image/jpeg,image/png]',
        'errors' => [
          'uploaded' => 'Gambar Wajib Dipilih.',
          'max_size' => 'Ukuran gambar terlalu besar',
          'is_image' => 'File wajib gambar',
          'mime_in' => 'Tipe File Gambar Tidak Sesuai'
        ]
      ],
    ])) {
      $validation = \Config\Services::validation();
      return redirect()->to('buku/tambah')->withInput()->with('validation', $validation);
    }

    $filesampul = $this->request->getFile('sampul');
    $filesampul->move('img');
    $namasampul = $filesampul->getName();

    $this->BukuModel->save([
      'judul' => $this->request->getVar('judul'),
      'pengarang' => $this->request->getVar('pengarang'),
      'penerbit' => $this->request->getVar('penerbit'),
      'tahun_terbit' => $this->request->getVar('tahun_terbit'),
      'sampul' => $namasampul
    ]);
---
INSERT INTO `buku` (`judul`, `pengarang`, `penerbit`, `tahun_terbit`, `sampul`) VALUES ('Et aliquam eum asper', 'Error cum unde debit', 'Enim in delectus ea', '15', 'Screenshot 2025-07-16 175746.png')