app/Models/BukuModel.php

SELECT *
FROM `buku`
SELECT *
FROM `buku`
WHERE `id_buku` = '1'
 LIMIT 1
---
    public function getBuku($idbuku = false)
    {
      if ($idbuku == false) {
        return $this->findAll();
      }
      return $this->where(['id_buku' => $idbuku])->first();